{
    "pitch_range": [
        21,
        109
    ],
    "beat_res": {
        "0_4": 8,
        "4_12": 4
    },
    "_nb_velocities": 32,
    "additional_tokens": {
        "Chord": false,
        "Rest": false,
        "Tempo": false,
        "TimeSignature": false,
        "Program": true,
        "rest_range": [
            2,
            8
        ],
        "chord_maps": {
            "min": [
                0,
                3,
                7
            ],
            "maj": [
                0,
                4,
                7
            ],
            "dim": [
                0,
                3,
                6
            ],
            "aug": [
                0,
                4,
                8
            ],
            "sus2": [
                0,
                2,
                7
            ],
            "sus4": [
                0,
                5,
                7
            ],
            "7dom": [
                0,
                4,
                7,
                10
            ],
            "7min": [
                0,
                3,
                7,
                10
            ],
            "7maj": [
                0,
                4,
                7,
                11
            ],
            "7halfdim": [
                0,
                3,
                6,
                10
            ],
            "7dim": [
                0,
                3,
                6,
                9
            ],
            "7aug": [
                0,
                4,
                8,
                11
            ],
            "9maj": [
                0,
                4,
                7,
                10,
                14
            ],
            "9min": [
                0,
                4,
                7,
                10,
                13
            ]
        },
        "chord_tokens_with_root_note": true,
        "chord_unknown": false,
        "nb_tempos": 32,
        "tempo_range": [
            40,
            250
        ],
        "time_signature_range": [
            8,
            2
        ],
        "programs": [
            -1,
            0,
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15,
            16,
            17,
            18,
            19,
            20,
            21,
            22,
            23,
            24,
            25,
            26,
            27,
            28,
            29,
            30,
            31,
            32,
            33,
            34,
            35,
            36,
            37,
            38,
            39,
            40,
            41,
            42,
            43,
            44,
            45,
            46,
            47,
            48,
            49,
            50,
            51,
            52,
            53,
            54,
            55,
            56,
            57,
            58,
            59,
            60,
            61,
            62,
            63,
            64,
            65,
            66,
            67,
            68,
            69,
            70,
            71,
            72,
            73,
            74,
            75,
            76,
            77,
            78,
            79,
            80,
            81,
            82,
            83,
            84,
            85,
            86,
            87,
            88,
            89,
            90,
            91,
            92,
            93,
            94,
            95,
            96,
            97,
            98,
            99,
            100,
            101,
            102,
            103,
            104,
            105,
            106,
            107,
            108,
            109,
            110,
            111,
            112,
            113,
            114,
            115,
            116,
            117,
            118,
            119,
            120,
            121,
            122,
            123,
            124,
            125,
            126,
            127
        ]
    },
    "special_tokens": [
        "PAD_None",
        "BOS_None",
        "EOS_None",
        "MASK_None"
    ],
    "unique_track": true,
    "has_bpe": true,
    "tokenization": "REMIPlus",
    "miditok_version": "2.0.1",
    "max_bar_embedding": 1313,
    "_vocab_base": {
        "PAD_None": 0,
        "BOS_None": 1,
        "EOS_None": 2,
        "MASK_None": 3,
        "Bar_0": 4,
        "Bar_1": 5,
        "Bar_2": 6,
        "Bar_3": 7,
        "Bar_4": 8,
        "Bar_5": 9,
        "Bar_6": 10,
        "Bar_7": 11,
        "Bar_8": 12,
        "Bar_9": 13,
        "Bar_10": 14,
        "Bar_11": 15,
        "Bar_12": 16,
        "Bar_13": 17,
        "Bar_14": 18,
        "Bar_15": 19,
        "Bar_16": 20,
        "Bar_17": 21,
        "Bar_18": 22,
        "Bar_19": 23,
        "Bar_20": 24,
        "Bar_21": 25,
        "Bar_22": 26,
        "Bar_23": 27,
        "Bar_24": 28,
        "Bar_25": 29,
        "Bar_26": 30,
        "Bar_27": 31,
        "Bar_28": 32,
        "Bar_29": 33,
        "Bar_30": 34,
        "Bar_31": 35,
        "Bar_32": 36,
        "Bar_33": 37,
        "Bar_34": 38,
        "Bar_35": 39,
        "Bar_36": 40,
        "Bar_37": 41,
        "Bar_38": 42,
        "Bar_39": 43,
        "Bar_40": 44,
        "Bar_41": 45,
        "Bar_42": 46,
        "Bar_43": 47,
        "Bar_44": 48,
        "Bar_45": 49,
        "Bar_46": 50,
        "Bar_47": 51,
        "Bar_48": 52,
        "Bar_49": 53,
        "Bar_50": 54,
        "Bar_51": 55,
        "Bar_52": 56,
        "Bar_53": 57,
        "Bar_54": 58,
        "Bar_55": 59,
        "Bar_56": 60,
        "Bar_57": 61,
        "Bar_58": 62,
        "Bar_59": 63,
        "Pitch_21": 64,
        "Pitch_22": 65,
        "Pitch_23": 66,
        "Pitch_24": 67,
        "Pitch_25": 68,
        "Pitch_26": 69,
        "Pitch_27": 70,
        "Pitch_28": 71,
        "Pitch_29": 72,
        "Pitch_30": 73,
        "Pitch_31": 74,
        "Pitch_32": 75,
        "Pitch_33": 76,
        "Pitch_34": 77,
        "Pitch_35": 78,
        "Pitch_36": 79,
        "Pitch_37": 80,
        "Pitch_38": 81,
        "Pitch_39": 82,
        "Pitch_40": 83,
        "Pitch_41": 84,
        "Pitch_42": 85,
        "Pitch_43": 86,
        "Pitch_44": 87,
        "Pitch_45": 88,
        "Pitch_46": 89,
        "Pitch_47": 90,
        "Pitch_48": 91,
        "Pitch_49": 92,
        "Pitch_50": 93,
        "Pitch_51": 94,
        "Pitch_52": 95,
        "Pitch_53": 96,
        "Pitch_54": 97,
        "Pitch_55": 98,
        "Pitch_56": 99,
        "Pitch_57": 100,
        "Pitch_58": 101,
        "Pitch_59": 102,
        "Pitch_60": 103,
        "Pitch_61": 104,
        "Pitch_62": 105,
        "Pitch_63": 106,
        "Pitch_64": 107,
        "Pitch_65": 108,
        "Pitch_66": 109,
        "Pitch_67": 110,
        "Pitch_68": 111,
        "Pitch_69": 112,
        "Pitch_70": 113,
        "Pitch_71": 114,
        "Pitch_72": 115,
        "Pitch_73": 116,
        "Pitch_74": 117,
        "Pitch_75": 118,
        "Pitch_76": 119,
        "Pitch_77": 120,
        "Pitch_78": 121,
        "Pitch_79": 122,
        "Pitch_80": 123,
        "Pitch_81": 124,
        "Pitch_82": 125,
        "Pitch_83": 126,
        "Pitch_84": 127,
        "Pitch_85": 128,
        "Pitch_86": 129,
        "Pitch_87": 130,
        "Pitch_88": 131,
        "Pitch_89": 132,
        "Pitch_90": 133,
        "Pitch_91": 134,
        "Pitch_92": 135,
        "Pitch_93": 136,
        "Pitch_94": 137,
        "Pitch_95": 138,
        "Pitch_96": 139,
        "Pitch_97": 140,
        "Pitch_98": 141,
        "Pitch_99": 142,
        "Pitch_100": 143,
        "Pitch_101": 144,
        "Pitch_102": 145,
        "Pitch_103": 146,
        "Pitch_104": 147,
        "Pitch_105": 148,
        "Pitch_106": 149,
        "Pitch_107": 150,
        "Pitch_108": 151,
        "Velocity_3": 152,
        "Velocity_7": 153,
        "Velocity_11": 154,
        "Velocity_15": 155,
        "Velocity_19": 156,
        "Velocity_23": 157,
        "Velocity_27": 158,
        "Velocity_31": 159,
        "Velocity_35": 160,
        "Velocity_39": 161,
        "Velocity_43": 162,
        "Velocity_47": 163,
        "Velocity_51": 164,
        "Velocity_55": 165,
        "Velocity_59": 166,
        "Velocity_63": 167,
        "Velocity_67": 168,
        "Velocity_71": 169,
        "Velocity_75": 170,
        "Velocity_79": 171,
        "Velocity_83": 172,
        "Velocity_87": 173,
        "Velocity_91": 174,
        "Velocity_95": 175,
        "Velocity_99": 176,
        "Velocity_103": 177,
        "Velocity_107": 178,
        "Velocity_111": 179,
        "Velocity_115": 180,
        "Velocity_119": 181,
        "Velocity_123": 182,
        "Velocity_127": 183,
        "Duration_0.1.8": 184,
        "Duration_0.2.8": 185,
        "Duration_0.3.8": 186,
        "Duration_0.4.8": 187,
        "Duration_0.5.8": 188,
        "Duration_0.6.8": 189,
        "Duration_0.7.8": 190,
        "Duration_1.0.8": 191,
        "Duration_1.1.8": 192,
        "Duration_1.2.8": 193,
        "Duration_1.3.8": 194,
        "Duration_1.4.8": 195,
        "Duration_1.5.8": 196,
        "Duration_1.6.8": 197,
        "Duration_1.7.8": 198,
        "Duration_2.0.8": 199,
        "Duration_2.1.8": 200,
        "Duration_2.2.8": 201,
        "Duration_2.3.8": 202,
        "Duration_2.4.8": 203,
        "Duration_2.5.8": 204,
        "Duration_2.6.8": 205,
        "Duration_2.7.8": 206,
        "Duration_3.0.8": 207,
        "Duration_3.1.8": 208,
        "Duration_3.2.8": 209,
        "Duration_3.3.8": 210,
        "Duration_3.4.8": 211,
        "Duration_3.5.8": 212,
        "Duration_3.6.8": 213,
        "Duration_3.7.8": 214,
        "Duration_4.0.4": 215,
        "Duration_4.1.4": 216,
        "Duration_4.2.4": 217,
        "Duration_4.3.4": 218,
        "Duration_5.0.4": 219,
        "Duration_5.1.4": 220,
        "Duration_5.2.4": 221,
        "Duration_5.3.4": 222,
        "Duration_6.0.4": 223,
        "Duration_6.1.4": 224,
        "Duration_6.2.4": 225,
        "Duration_6.3.4": 226,
        "Duration_7.0.4": 227,
        "Duration_7.1.4": 228,
        "Duration_7.2.4": 229,
        "Duration_7.3.4": 230,
        "Duration_8.0.4": 231,
        "Duration_8.1.4": 232,
        "Duration_8.2.4": 233,
        "Duration_8.3.4": 234,
        "Duration_9.0.4": 235,
        "Duration_9.1.4": 236,
        "Duration_9.2.4": 237,
        "Duration_9.3.4": 238,
        "Duration_10.0.4": 239,
        "Duration_10.1.4": 240,
        "Duration_10.2.4": 241,
        "Duration_10.3.4": 242,
        "Duration_11.0.4": 243,
        "Duration_11.1.4": 244,
        "Duration_11.2.4": 245,
        "Duration_11.3.4": 246,
        "Duration_12.0.4": 247,
        "Position_0": 248,
        "Position_1": 249,
        "Position_2": 250,
        "Position_3": 251,
        "Position_4": 252,
        "Position_5": 253,
        "Position_6": 254,
        "Position_7": 255,
        "Position_8": 256,
        "Position_9": 257,
        "Position_10": 258,
        "Position_11": 259,
        "Position_12": 260,
        "Position_13": 261,
        "Position_14": 262,
        "Position_15": 263,
        "Position_16": 264,
        "Position_17": 265,
        "Position_18": 266,
        "Position_19": 267,
        "Position_20": 268,
        "Position_21": 269,
        "Position_22": 270,
        "Position_23": 271,
        "Position_24": 272,
        "Position_25": 273,
        "Position_26": 274,
        "Position_27": 275,
        "Position_28": 276,
        "Position_29": 277,
        "Position_30": 278,
        "Position_31": 279,
        "Program_-1": 280,
        "Program_0": 281,
        "Program_1": 282,
        "Program_2": 283,
        "Program_3": 284,
        "Program_4": 285,
        "Program_5": 286,
        "Program_6": 287,
        "Program_7": 288,
        "Program_8": 289,
        "Program_9": 290,
        "Program_10": 291,
        "Program_11": 292,
        "Program_12": 293,
        "Program_13": 294,
        "Program_14": 295,
        "Program_15": 296,
        "Program_16": 297,
        "Program_17": 298,
        "Program_18": 299,
        "Program_19": 300,
        "Program_20": 301,
        "Program_21": 302,
        "Program_22": 303,
        "Program_23": 304,
        "Program_24": 305,
        "Program_25": 306,
        "Program_26": 307,
        "Program_27": 308,
        "Program_28": 309,
        "Program_29": 310,
        "Program_30": 311,
        "Program_31": 312,
        "Program_32": 313,
        "Program_33": 314,
        "Program_34": 315,
        "Program_35": 316,
        "Program_36": 317,
        "Program_37": 318,
        "Program_38": 319,
        "Program_39": 320,
        "Program_40": 321,
        "Program_41": 322,
        "Program_42": 323,
        "Program_43": 324,
        "Program_44": 325,
        "Program_45": 326,
        "Program_46": 327,
        "Program_47": 328,
        "Program_48": 329,
        "Program_49": 330,
        "Program_50": 331,
        "Program_51": 332,
        "Program_52": 333,
        "Program_53": 334,
        "Program_54": 335,
        "Program_55": 336,
        "Program_56": 337,
        "Program_57": 338,
        "Program_58": 339,
        "Program_59": 340,
        "Program_60": 341,
        "Program_61": 342,
        "Program_62": 343,
        "Program_63": 344,
        "Program_64": 345,
        "Program_65": 346,
        "Program_66": 347,
        "Program_67": 348,
        "Program_68": 349,
        "Program_69": 350,
        "Program_70": 351,
        "Program_71": 352,
        "Program_72": 353,
        "Program_73": 354,
        "Program_74": 355,
        "Program_75": 356,
        "Program_76": 357,
        "Program_77": 358,
        "Program_78": 359,
        "Program_79": 360,
        "Program_80": 361,
        "Program_81": 362,
        "Program_82": 363,
        "Program_83": 364,
        "Program_84": 365,
        "Program_85": 366,
        "Program_86": 367,
        "Program_87": 368,
        "Program_88": 369,
        "Program_89": 370,
        "Program_90": 371,
        "Program_91": 372,
        "Program_92": 373,
        "Program_93": 374,
        "Program_94": 375,
        "Program_95": 376,
        "Program_96": 377,
        "Program_97": 378,
        "Program_98": 379,
        "Program_99": 380,
        "Program_100": 381,
        "Program_101": 382,
        "Program_102": 383,
        "Program_103": 384,
        "Program_104": 385,
        "Program_105": 386,
        "Program_106": 387,
        "Program_107": 388,
        "Program_108": 389,
        "Program_109": 390,
        "Program_110": 391,
        "Program_111": 392,
        "Program_112": 393,
        "Program_113": 394,
        "Program_114": 395,
        "Program_115": 396,
        "Program_116": 397,
        "Program_117": 398,
        "Program_118": 399,
        "Program_119": 400,
        "Program_120": 401,
        "Program_121": 402,
        "Program_122": 403,
        "Program_123": 404,
        "Program_124": 405,
        "Program_125": 406,
        "Program_126": 407,
        "Program_127": 408,
        "Bar_60": 409,
        "Bar_61": 410,
        "Bar_62": 411,
        "Bar_63": 412,
        "Bar_64": 413,
        "Bar_65": 414,
        "Bar_66": 415,
        "Bar_67": 416,
        "Bar_68": 417,
        "Bar_69": 418,
        "Bar_70": 419,
        "Bar_71": 420,
        "Bar_72": 421,
        "Bar_73": 422,
        "Bar_74": 423,
        "Bar_75": 424,
        "Bar_76": 425,
        "Bar_77": 426,
        "Bar_78": 427,
        "Bar_79": 428,
        "Bar_80": 429,
        "Bar_81": 430,
        "Bar_82": 431,
        "Bar_83": 432,
        "Bar_84": 433,
        "Bar_85": 434,
        "Bar_86": 435,
        "Bar_87": 436,
        "Bar_88": 437,
        "Bar_89": 438,
        "Bar_90": 439,
        "Bar_91": 440,
        "Bar_92": 441,
        "Bar_93": 442,
        "Bar_94": 443,
        "Bar_95": 444,
        "Bar_96": 445,
        "Bar_97": 446,
        "Bar_98": 447,
        "Bar_99": 448,
        "Bar_100": 449,
        "Bar_101": 450,
        "Bar_102": 451,
        "Bar_103": 452,
        "Bar_104": 453,
        "Bar_105": 454,
        "Bar_106": 455,
        "Bar_107": 456,
        "Bar_108": 457,
        "Bar_109": 458,
        "Bar_110": 459,
        "Bar_111": 460,
        "Bar_112": 461,
        "Bar_113": 462,
        "Bar_114": 463,
        "Bar_115": 464,
        "Bar_116": 465,
        "Bar_117": 466,
        "Bar_118": 467,
        "Bar_119": 468,
        "Bar_120": 469,
        "Bar_121": 470,
        "Bar_122": 471,
        "Bar_123": 472,
        "Bar_124": 473,
        "Bar_125": 474,
        "Bar_126": 475,
        "Bar_127": 476,
        "Bar_128": 477,
        "Bar_129": 478,
        "Bar_130": 479,
        "Bar_131": 480,
        "Bar_132": 481,
        "Bar_133": 482,
        "Bar_134": 483,
        "Bar_135": 484,
        "Bar_136": 485,
        "Bar_137": 486,
        "Bar_138": 487,
        "Bar_139": 488,
        "Bar_140": 489,
        "Bar_141": 490,
        "Bar_142": 491,
        "Bar_143": 492,
        "Bar_144": 493,
        "Bar_145": 494,
        "Bar_146": 495,
        "Bar_147": 496,
        "Bar_148": 497,
        "Bar_149": 498,
        "Bar_150": 499,
        "Bar_151": 500,
        "Bar_152": 501,
        "Bar_153": 502,
        "Bar_154": 503,
        "Bar_155": 504,
        "Bar_156": 505,
        "Bar_157": 506,
        "Bar_158": 507,
        "Bar_159": 508,
        "Bar_160": 509,
        "Bar_161": 510,
        "Bar_162": 511,
        "Bar_163": 512,
        "Bar_164": 513,
        "Bar_165": 514,
        "Bar_166": 515,
        "Bar_167": 516,
        "Bar_168": 517,
        "Bar_169": 518,
        "Bar_170": 519,
        "Bar_171": 520,
        "Bar_172": 521,
        "Bar_173": 522,
        "Bar_174": 523,
        "Bar_175": 524,
        "Bar_176": 525,
        "Bar_177": 526,
        "Bar_178": 527,
        "Bar_179": 528,
        "Bar_180": 529,
        "Bar_181": 530,
        "Bar_182": 531,
        "Bar_183": 532,
        "Bar_184": 533,
        "Bar_185": 534,
        "Bar_186": 535,
        "Bar_187": 536,
        "Bar_188": 537,
        "Bar_189": 538,
        "Bar_190": 539,
        "Bar_191": 540,
        "Bar_192": 541,
        "Bar_193": 542,
        "Bar_194": 543,
        "Bar_195": 544,
        "Bar_196": 545,
        "Bar_197": 546,
        "Bar_198": 547,
        "Bar_199": 548,
        "Bar_200": 549,
        "Bar_201": 550,
        "Bar_202": 551,
        "Bar_203": 552,
        "Bar_204": 553,
        "Bar_205": 554,
        "Bar_206": 555,
        "Bar_207": 556,
        "Bar_208": 557,
        "Bar_209": 558,
        "Bar_210": 559,
        "Bar_211": 560,
        "Bar_212": 561,
        "Bar_213": 562,
        "Bar_214": 563,
        "Bar_215": 564,
        "Bar_216": 565,
        "Bar_217": 566,
        "Bar_218": 567,
        "Bar_219": 568,
        "Bar_220": 569,
        "Bar_221": 570,
        "Bar_222": 571,
        "Bar_223": 572,
        "Bar_224": 573,
        "Bar_225": 574,
        "Bar_226": 575,
        "Bar_227": 576,
        "Bar_228": 577,
        "Bar_229": 578,
        "Bar_230": 579,
        "Bar_231": 580,
        "Bar_232": 581,
        "Bar_233": 582,
        "Bar_234": 583,
        "Bar_235": 584,
        "Bar_236": 585,
        "Bar_237": 586,
        "Bar_238": 587,
        "Bar_239": 588,
        "Bar_240": 589,
        "Bar_241": 590,
        "Bar_242": 591,
        "Bar_243": 592,
        "Bar_244": 593,
        "Bar_245": 594,
        "Bar_246": 595,
        "Bar_247": 596,
        "Bar_248": 597,
        "Bar_249": 598,
        "Bar_250": 599,
        "Bar_251": 600,
        "Bar_252": 601,
        "Bar_253": 602,
        "Bar_254": 603,
        "Bar_255": 604,
        "Bar_256": 605,
        "Bar_257": 606,
        "Bar_258": 607,
        "Bar_259": 608,
        "Bar_260": 609,
        "Bar_261": 610,
        "Bar_262": 611,
        "Bar_263": 612,
        "Bar_264": 613,
        "Bar_265": 614,
        "Bar_266": 615,
        "Bar_267": 616,
        "Bar_268": 617,
        "Bar_269": 618,
        "Bar_270": 619,
        "Bar_271": 620,
        "Bar_272": 621,
        "Bar_273": 622,
        "Bar_274": 623,
        "Bar_275": 624,
        "Bar_276": 625,
        "Bar_277": 626,
        "Bar_278": 627,
        "Bar_279": 628,
        "Bar_280": 629,
        "Bar_281": 630,
        "Bar_282": 631,
        "Bar_283": 632,
        "Bar_284": 633,
        "Bar_285": 634,
        "Bar_286": 635,
        "Bar_287": 636,
        "Bar_288": 637,
        "Bar_289": 638,
        "Bar_290": 639,
        "Bar_291": 640,
        "Bar_292": 641,
        "Bar_293": 642,
        "Bar_294": 643,
        "Bar_295": 644,
        "Bar_296": 645,
        "Bar_297": 646,
        "Bar_298": 647,
        "Bar_299": 648,
        "Bar_300": 649,
        "Bar_301": 650,
        "Bar_302": 651,
        "Bar_303": 652,
        "Bar_304": 653,
        "Bar_305": 654,
        "Bar_306": 655,
        "Bar_307": 656,
        "Bar_308": 657,
        "Bar_309": 658,
        "Bar_310": 659,
        "Bar_311": 660,
        "Bar_312": 661,
        "Bar_313": 662,
        "Bar_314": 663,
        "Bar_315": 664,
        "Bar_316": 665,
        "Bar_317": 666,
        "Bar_318": 667,
        "Bar_319": 668,
        "Bar_320": 669,
        "Bar_321": 670,
        "Bar_322": 671,
        "Bar_323": 672,
        "Bar_324": 673,
        "Bar_325": 674,
        "Bar_326": 675,
        "Bar_327": 676,
        "Bar_328": 677,
        "Bar_329": 678,
        "Bar_330": 679,
        "Bar_331": 680,
        "Bar_332": 681,
        "Bar_333": 682,
        "Bar_334": 683,
        "Bar_335": 684,
        "Bar_336": 685,
        "Bar_337": 686,
        "Bar_338": 687,
        "Bar_339": 688,
        "Bar_340": 689,
        "Bar_341": 690,
        "Bar_342": 691,
        "Bar_343": 692,
        "Bar_344": 693,
        "Bar_345": 694,
        "Bar_346": 695,
        "Bar_347": 696,
        "Bar_348": 697,
        "Bar_349": 698,
        "Bar_350": 699,
        "Bar_351": 700,
        "Bar_352": 701,
        "Bar_353": 702,
        "Bar_354": 703,
        "Bar_355": 704,
        "Bar_356": 705,
        "Bar_357": 706,
        "Bar_358": 707,
        "Bar_359": 708,
        "Bar_360": 709,
        "Bar_361": 710,
        "Bar_362": 711,
        "Bar_363": 712,
        "Bar_364": 713,
        "Bar_365": 714,
        "Bar_366": 715,
        "Bar_367": 716,
        "Bar_368": 717,
        "Bar_369": 718,
        "Bar_370": 719,
        "Bar_371": 720,
        "Bar_372": 721,
        "Bar_373": 722,
        "Bar_374": 723,
        "Bar_375": 724,
        "Bar_376": 725,
        "Bar_377": 726,
        "Bar_378": 727,
        "Bar_379": 728,
        "Bar_380": 729,
        "Bar_381": 730,
        "Bar_382": 731,
        "Bar_383": 732,
        "Bar_384": 733,
        "Bar_385": 734,
        "Bar_386": 735,
        "Bar_387": 736,
        "Bar_388": 737,
        "Bar_389": 738,
        "Bar_390": 739,
        "Bar_391": 740,
        "Bar_392": 741,
        "Bar_393": 742,
        "Bar_394": 743,
        "Bar_395": 744,
        "Bar_396": 745,
        "Bar_397": 746,
        "Bar_398": 747,
        "Bar_399": 748,
        "Bar_400": 749,
        "Bar_401": 750,
        "Bar_402": 751,
        "Bar_403": 752,
        "Bar_404": 753,
        "Bar_405": 754,
        "Bar_406": 755,
        "Bar_407": 756,
        "Bar_408": 757,
        "Bar_409": 758,
        "Bar_410": 759,
        "Bar_411": 760,
        "Bar_412": 761,
        "Bar_413": 762,
        "Bar_414": 763,
        "Bar_415": 764,
        "Bar_416": 765,
        "Bar_417": 766,
        "Bar_418": 767,
        "Bar_419": 768,
        "Bar_420": 769,
        "Bar_421": 770,
        "Bar_422": 771,
        "Bar_423": 772,
        "Bar_424": 773,
        "Bar_425": 774,
        "Bar_426": 775,
        "Bar_427": 776,
        "Bar_428": 777,
        "Bar_429": 778,
        "Bar_430": 779,
        "Bar_431": 780,
        "Bar_432": 781,
        "Bar_433": 782,
        "Bar_434": 783,
        "Bar_435": 784,
        "Bar_436": 785,
        "Bar_437": 786,
        "Bar_438": 787,
        "Bar_439": 788,
        "Bar_440": 789,
        "Bar_441": 790,
        "Bar_442": 791,
        "Bar_443": 792,
        "Bar_444": 793,
        "Bar_445": 794,
        "Bar_446": 795,
        "Bar_447": 796,
        "Bar_448": 797,
        "Bar_449": 798,
        "Bar_450": 799,
        "Bar_451": 800,
        "Bar_452": 801,
        "Bar_453": 802,
        "Bar_454": 803,
        "Bar_455": 804,
        "Bar_456": 805,
        "Bar_457": 806,
        "Bar_458": 807,
        "Bar_459": 808,
        "Bar_460": 809,
        "Bar_461": 810,
        "Bar_462": 811,
        "Bar_463": 812,
        "Bar_464": 813,
        "Bar_465": 814,
        "Bar_466": 815,
        "Bar_467": 816,
        "Bar_468": 817,
        "Bar_469": 818,
        "Bar_470": 819,
        "Bar_471": 820,
        "Bar_472": 821,
        "Bar_473": 822,
        "Bar_474": 823,
        "Bar_475": 824,
        "Bar_476": 825,
        "Bar_477": 826,
        "Bar_478": 827,
        "Bar_479": 828,
        "Bar_480": 829,
        "Bar_481": 830,
        "Bar_482": 831,
        "Bar_483": 832,
        "Bar_484": 833,
        "Bar_485": 834,
        "Bar_486": 835,
        "Bar_487": 836,
        "Bar_488": 837,
        "Bar_489": 838,
        "Bar_490": 839,
        "Bar_491": 840,
        "Bar_492": 841,
        "Bar_493": 842,
        "Bar_494": 843,
        "Bar_495": 844,
        "Bar_496": 845,
        "Bar_497": 846,
        "Bar_498": 847,
        "Bar_499": 848,
        "Bar_500": 849,
        "Bar_501": 850,
        "Bar_502": 851,
        "Bar_503": 852,
        "Bar_504": 853,
        "Bar_505": 854,
        "Bar_506": 855,
        "Bar_507": 856,
        "Bar_508": 857,
        "Bar_509": 858,
        "Bar_510": 859,
        "Bar_511": 860,
        "Bar_512": 861,
        "Bar_513": 862,
        "Bar_514": 863,
        "Bar_515": 864,
        "Bar_516": 865,
        "Bar_517": 866,
        "Bar_518": 867,
        "Bar_519": 868,
        "Bar_520": 869,
        "Bar_521": 870,
        "Bar_522": 871,
        "Bar_523": 872,
        "Bar_524": 873,
        "Bar_525": 874,
        "Bar_526": 875,
        "Bar_527": 876,
        "Bar_528": 877,
        "Bar_529": 878,
        "Bar_530": 879,
        "Bar_531": 880,
        "Bar_532": 881,
        "Bar_533": 882,
        "Bar_534": 883,
        "Bar_535": 884,
        "Bar_536": 885,
        "Bar_537": 886,
        "Bar_538": 887,
        "Bar_539": 888,
        "Bar_540": 889,
        "Bar_541": 890,
        "Bar_542": 891,
        "Bar_543": 892,
        "Bar_544": 893,
        "Bar_545": 894,
        "Bar_546": 895,
        "Bar_547": 896,
        "Bar_548": 897,
        "Bar_549": 898,
        "Bar_550": 899,
        "Bar_551": 900,
        "Bar_552": 901,
        "Bar_553": 902,
        "Bar_554": 903,
        "Bar_555": 904,
        "Bar_556": 905,
        "Bar_557": 906,
        "Bar_558": 907,
        "Bar_559": 908,
        "Bar_560": 909,
        "Bar_561": 910,
        "Bar_562": 911,
        "Bar_563": 912,
        "Bar_564": 913,
        "Bar_565": 914,
        "Bar_566": 915,
        "Bar_567": 916,
        "Bar_568": 917,
        "Bar_569": 918,
        "Bar_570": 919,
        "Bar_571": 920,
        "Bar_572": 921,
        "Bar_573": 922,
        "Bar_574": 923,
        "Bar_575": 924,
        "Bar_576": 925,
        "Bar_577": 926,
        "Bar_578": 927,
        "Bar_579": 928,
        "Bar_580": 929,
        "Bar_581": 930,
        "Bar_582": 931,
        "Bar_583": 932,
        "Bar_584": 933,
        "Bar_585": 934,
        "Bar_586": 935,
        "Bar_587": 936,
        "Bar_588": 937,
        "Bar_589": 938,
        "Bar_590": 939,
        "Bar_591": 940,
        "Bar_592": 941,
        "Bar_593": 942,
        "Bar_594": 943,
        "Bar_595": 944,
        "Bar_596": 945,
        "Bar_597": 946,
        "Bar_598": 947,
        "Bar_599": 948,
        "Bar_600": 949,
        "Bar_601": 950,
        "Bar_602": 951,
        "Bar_603": 952,
        "Bar_604": 953,
        "Bar_605": 954,
        "Bar_606": 955,
        "Bar_607": 956,
        "Bar_608": 957,
        "Bar_609": 958,
        "Bar_610": 959,
        "Bar_611": 960,
        "Bar_612": 961,
        "Bar_613": 962,
        "Bar_614": 963,
        "Bar_615": 964,
        "Bar_616": 965,
        "Bar_617": 966,
        "Bar_618": 967,
        "Bar_619": 968,
        "Bar_620": 969,
        "Bar_621": 970,
        "Bar_622": 971,
        "Bar_623": 972,
        "Bar_624": 973,
        "Bar_625": 974,
        "Bar_626": 975,
        "Bar_627": 976,
        "Bar_628": 977,
        "Bar_629": 978,
        "Bar_630": 979,
        "Bar_631": 980,
        "Bar_632": 981,
        "Bar_633": 982,
        "Bar_634": 983,
        "Bar_635": 984,
        "Bar_636": 985,
        "Bar_637": 986,
        "Bar_638": 987,
        "Bar_639": 988,
        "Bar_640": 989,
        "Bar_641": 990,
        "Bar_642": 991,
        "Bar_643": 992,
        "Bar_644": 993,
        "Bar_645": 994,
        "Bar_646": 995,
        "Bar_647": 996,
        "Bar_648": 997,
        "Bar_649": 998,
        "Bar_650": 999,
        "Bar_651": 1000,
        "Bar_652": 1001,
        "Bar_653": 1002,
        "Bar_654": 1003,
        "Bar_655": 1004,
        "Bar_656": 1005,
        "Bar_657": 1006,
        "Bar_658": 1007,
        "Bar_659": 1008,
        "Bar_660": 1009,
        "Bar_661": 1010,
        "Bar_662": 1011,
        "Bar_663": 1012,
        "Bar_664": 1013,
        "Bar_665": 1014,
        "Bar_666": 1015,
        "Bar_667": 1016,
        "Bar_668": 1017,
        "Bar_669": 1018,
        "Bar_670": 1019,
        "Bar_671": 1020,
        "Bar_672": 1021,
        "Bar_673": 1022,
        "Bar_674": 1023,
        "Bar_675": 1024,
        "Bar_676": 1025,
        "Bar_677": 1026,
        "Bar_678": 1027,
        "Bar_679": 1028,
        "Bar_680": 1029,
        "Bar_681": 1030,
        "Bar_682": 1031,
        "Bar_683": 1032,
        "Bar_684": 1033,
        "Bar_685": 1034,
        "Bar_686": 1035,
        "Bar_687": 1036,
        "Bar_688": 1037,
        "Bar_689": 1038,
        "Bar_690": 1039,
        "Bar_691": 1040,
        "Bar_692": 1041,
        "Bar_693": 1042,
        "Bar_694": 1043,
        "Bar_695": 1044,
        "Bar_696": 1045,
        "Bar_697": 1046,
        "Bar_698": 1047,
        "Bar_699": 1048,
        "Bar_700": 1049,
        "Bar_701": 1050,
        "Bar_702": 1051,
        "Bar_703": 1052,
        "Bar_704": 1053,
        "Bar_705": 1054,
        "Bar_706": 1055,
        "Bar_707": 1056,
        "Bar_708": 1057,
        "Bar_709": 1058,
        "Bar_710": 1059,
        "Bar_711": 1060,
        "Bar_712": 1061,
        "Bar_713": 1062,
        "Bar_714": 1063,
        "Bar_715": 1064,
        "Bar_716": 1065,
        "Bar_717": 1066,
        "Bar_718": 1067,
        "Bar_719": 1068,
        "Bar_720": 1069,
        "Bar_721": 1070,
        "Bar_722": 1071,
        "Bar_723": 1072,
        "Bar_724": 1073,
        "Bar_725": 1074,
        "Bar_726": 1075,
        "Bar_727": 1076,
        "Bar_728": 1077,
        "Bar_729": 1078,
        "Bar_730": 1079,
        "Bar_731": 1080,
        "Bar_732": 1081,
        "Bar_733": 1082,
        "Bar_734": 1083,
        "Bar_735": 1084,
        "Bar_736": 1085,
        "Bar_737": 1086,
        "Bar_738": 1087,
        "Bar_739": 1088,
        "Bar_740": 1089,
        "Bar_741": 1090,
        "Bar_742": 1091,
        "Bar_743": 1092,
        "Bar_744": 1093,
        "Bar_745": 1094,
        "Bar_746": 1095,
        "Bar_747": 1096,
        "Bar_748": 1097,
        "Bar_749": 1098,
        "Bar_750": 1099,
        "Bar_751": 1100,
        "Bar_752": 1101,
        "Bar_753": 1102,
        "Bar_754": 1103,
        "Bar_755": 1104,
        "Bar_756": 1105,
        "Bar_757": 1106,
        "Bar_758": 1107,
        "Bar_759": 1108,
        "Bar_760": 1109,
        "Bar_761": 1110,
        "Bar_762": 1111,
        "Bar_763": 1112,
        "Bar_764": 1113,
        "Bar_765": 1114,
        "Bar_766": 1115,
        "Bar_767": 1116,
        "Bar_768": 1117,
        "Bar_769": 1118,
        "Bar_770": 1119,
        "Bar_771": 1120,
        "Bar_772": 1121,
        "Bar_773": 1122,
        "Bar_774": 1123,
        "Bar_775": 1124,
        "Bar_776": 1125,
        "Bar_777": 1126,
        "Bar_778": 1127,
        "Bar_779": 1128,
        "Bar_780": 1129,
        "Bar_781": 1130,
        "Bar_782": 1131,
        "Bar_783": 1132,
        "Bar_784": 1133,
        "Bar_785": 1134,
        "Bar_786": 1135,
        "Bar_787": 1136,
        "Bar_788": 1137,
        "Bar_789": 1138,
        "Bar_790": 1139,
        "Bar_791": 1140,
        "Bar_792": 1141,
        "Bar_793": 1142,
        "Bar_794": 1143,
        "Bar_795": 1144,
        "Bar_796": 1145,
        "Bar_797": 1146,
        "Bar_798": 1147,
        "Bar_799": 1148,
        "Bar_800": 1149,
        "Bar_801": 1150,
        "Bar_802": 1151,
        "Bar_803": 1152,
        "Bar_804": 1153,
        "Bar_805": 1154,
        "Bar_806": 1155,
        "Bar_807": 1156,
        "Bar_808": 1157,
        "Bar_809": 1158,
        "Bar_810": 1159,
        "Bar_811": 1160,
        "Bar_812": 1161,
        "Bar_813": 1162,
        "Bar_814": 1163,
        "Bar_815": 1164,
        "Bar_816": 1165,
        "Bar_817": 1166,
        "Bar_818": 1167,
        "Bar_819": 1168,
        "Bar_820": 1169,
        "Bar_821": 1170,
        "Bar_822": 1171,
        "Bar_823": 1172,
        "Bar_824": 1173,
        "Bar_825": 1174,
        "Bar_826": 1175,
        "Bar_827": 1176,
        "Bar_828": 1177,
        "Bar_829": 1178,
        "Bar_830": 1179,
        "Bar_831": 1180,
        "Bar_832": 1181,
        "Bar_833": 1182,
        "Bar_834": 1183,
        "Bar_835": 1184,
        "Bar_836": 1185,
        "Bar_837": 1186,
        "Bar_838": 1187,
        "Bar_839": 1188,
        "Bar_840": 1189,
        "Bar_841": 1190,
        "Bar_842": 1191,
        "Bar_843": 1192,
        "Bar_844": 1193,
        "Bar_845": 1194,
        "Bar_846": 1195,
        "Bar_847": 1196,
        "Bar_848": 1197,
        "Bar_849": 1198,
        "Bar_850": 1199,
        "Bar_851": 1200,
        "Bar_852": 1201,
        "Bar_853": 1202,
        "Bar_854": 1203,
        "Bar_855": 1204,
        "Bar_856": 1205,
        "Bar_857": 1206,
        "Bar_858": 1207,
        "Bar_859": 1208,
        "Bar_860": 1209,
        "Bar_861": 1210,
        "Bar_862": 1211,
        "Bar_863": 1212,
        "Bar_864": 1213,
        "Bar_865": 1214,
        "Bar_866": 1215,
        "Bar_867": 1216,
        "Bar_868": 1217,
        "Bar_869": 1218,
        "Bar_870": 1219,
        "Bar_871": 1220,
        "Bar_872": 1221,
        "Bar_873": 1222,
        "Bar_874": 1223,
        "Bar_875": 1224,
        "Bar_876": 1225,
        "Bar_877": 1226,
        "Bar_878": 1227,
        "Bar_879": 1228,
        "Bar_880": 1229,
        "Bar_881": 1230,
        "Bar_882": 1231,
        "Bar_883": 1232,
        "Bar_884": 1233,
        "Bar_885": 1234,
        "Bar_886": 1235,
        "Bar_887": 1236,
        "Bar_888": 1237,
        "Bar_889": 1238,
        "Bar_890": 1239,
        "Bar_891": 1240,
        "Bar_892": 1241,
        "Bar_893": 1242,
        "Bar_894": 1243,
        "Bar_895": 1244,
        "Bar_896": 1245,
        "Bar_897": 1246,
        "Bar_898": 1247,
        "Bar_899": 1248,
        "Bar_900": 1249,
        "Bar_901": 1250,
        "Bar_902": 1251,
        "Bar_903": 1252,
        "Bar_904": 1253,
        "Bar_905": 1254,
        "Bar_906": 1255,
        "Bar_907": 1256,
        "Bar_908": 1257,
        "Bar_909": 1258,
        "Bar_910": 1259,
        "Bar_911": 1260,
        "Bar_912": 1261,
        "Bar_913": 1262,
        "Bar_914": 1263,
        "Bar_915": 1264,
        "Bar_916": 1265,
        "Bar_917": 1266,
        "Bar_918": 1267,
        "Bar_919": 1268,
        "Bar_920": 1269,
        "Bar_921": 1270,
        "Bar_922": 1271,
        "Bar_923": 1272,
        "Bar_924": 1273,
        "Bar_925": 1274,
        "Bar_926": 1275,
        "Bar_927": 1276,
        "Bar_928": 1277,
        "Bar_929": 1278,
        "Bar_930": 1279,
        "Bar_931": 1280,
        "Bar_932": 1281,
        "Bar_933": 1282,
        "Bar_934": 1283,
        "Bar_935": 1284,
        "Bar_936": 1285,
        "Bar_937": 1286,
        "Bar_938": 1287,
        "Bar_939": 1288,
        "Bar_940": 1289,
        "Bar_941": 1290,
        "Bar_942": 1291,
        "Bar_943": 1292,
        "Bar_944": 1293,
        "Bar_945": 1294,
        "Bar_946": 1295,
        "Bar_947": 1296,
        "Bar_948": 1297,
        "Bar_949": 1298,
        "Bar_950": 1299,
        "Bar_951": 1300,
        "Bar_952": 1301,
        "Bar_953": 1302,
        "Bar_954": 1303,
        "Bar_955": 1304,
        "Bar_956": 1305,
        "Bar_957": 1306,
        "Bar_958": 1307,
        "Bar_959": 1308,
        "Bar_960": 1309,
        "Bar_961": 1310,
        "Bar_962": 1311,
        "Bar_963": 1312,
        "Bar_964": 1313,
        "Bar_965": 1314,
        "Bar_966": 1315,
        "Bar_967": 1316,
        "Bar_968": 1317,
        "Bar_969": 1318,
        "Bar_970": 1319,
        "Bar_971": 1320,
        "Bar_972": 1321,
        "Bar_973": 1322,
        "Bar_974": 1323,
        "Bar_975": 1324,
        "Bar_976": 1325,
        "Bar_977": 1326,
        "Bar_978": 1327,
        "Bar_979": 1328,
        "Bar_980": 1329,
        "Bar_981": 1330,
        "Bar_982": 1331,
        "Bar_983": 1332,
        "Bar_984": 1333,
        "Bar_985": 1334,
        "Bar_986": 1335,
        "Bar_987": 1336,
        "Bar_988": 1337,
        "Bar_989": 1338,
        "Bar_990": 1339,
        "Bar_991": 1340,
        "Bar_992": 1341,
        "Bar_993": 1342,
        "Bar_994": 1343,
        "Bar_995": 1344,
        "Bar_996": 1345,
        "Bar_997": 1346,
        "Bar_998": 1347,
        "Bar_999": 1348,
        "Bar_1000": 1349,
        "Bar_1001": 1350,
        "Bar_1002": 1351,
        "Bar_1003": 1352,
        "Bar_1004": 1353,
        "Bar_1005": 1354,
        "Bar_1006": 1355,
        "Bar_1007": 1356,
        "Bar_1008": 1357,
        "Bar_1009": 1358,
        "Bar_1010": 1359,
        "Bar_1011": 1360,
        "Bar_1012": 1361,
        "Bar_1013": 1362,
        "Bar_1014": 1363,
        "Bar_1015": 1364,
        "Bar_1016": 1365,
        "Bar_1017": 1366,
        "Bar_1018": 1367,
        "Bar_1019": 1368,
        "Bar_1020": 1369,
        "Bar_1021": 1370,
        "Bar_1022": 1371,
        "Bar_1023": 1372,
        "Bar_1024": 1373,
        "Bar_1025": 1374,
        "Bar_1026": 1375,
        "Bar_1027": 1376,
        "Bar_1028": 1377,
        "Bar_1029": 1378,
        "Bar_1030": 1379,
        "Bar_1031": 1380,
        "Bar_1032": 1381,
        "Bar_1033": 1382,
        "Bar_1034": 1383,
        "Bar_1035": 1384,
        "Bar_1036": 1385,
        "Bar_1037": 1386,
        "Bar_1038": 1387,
        "Bar_1039": 1388,
        "Bar_1040": 1389,
        "Bar_1041": 1390,
        "Bar_1042": 1391,
        "Bar_1043": 1392,
        "Bar_1044": 1393,
        "Bar_1045": 1394,
        "Bar_1046": 1395,
        "Bar_1047": 1396,
        "Bar_1048": 1397,
        "Bar_1049": 1398,
        "Bar_1050": 1399,
        "Bar_1051": 1400,
        "Bar_1052": 1401,
        "Bar_1053": 1402,
        "Bar_1054": 1403,
        "Bar_1055": 1404,
        "Bar_1056": 1405,
        "Bar_1057": 1406,
        "Bar_1058": 1407,
        "Bar_1059": 1408,
        "Bar_1060": 1409,
        "Bar_1061": 1410,
        "Bar_1062": 1411,
        "Bar_1063": 1412,
        "Bar_1064": 1413,
        "Bar_1065": 1414,
        "Bar_1066": 1415,
        "Bar_1067": 1416,
        "Bar_1068": 1417,
        "Bar_1069": 1418,
        "Bar_1070": 1419,
        "Bar_1071": 1420,
        "Bar_1072": 1421,
        "Bar_1073": 1422,
        "Bar_1074": 1423,
        "Bar_1075": 1424,
        "Bar_1076": 1425,
        "Bar_1077": 1426,
        "Bar_1078": 1427,
        "Bar_1079": 1428,
        "Bar_1080": 1429,
        "Bar_1081": 1430,
        "Bar_1082": 1431,
        "Bar_1083": 1432,
        "Bar_1084": 1433,
        "Bar_1085": 1434,
        "Bar_1086": 1435,
        "Bar_1087": 1436,
        "Bar_1088": 1437,
        "Bar_1089": 1438,
        "Bar_1090": 1439,
        "Bar_1091": 1440,
        "Bar_1092": 1441,
        "Bar_1093": 1442,
        "Bar_1094": 1443,
        "Bar_1095": 1444,
        "Bar_1096": 1445,
        "Bar_1097": 1446,
        "Bar_1098": 1447,
        "Bar_1099": 1448,
        "Bar_1100": 1449,
        "Bar_1101": 1450,
        "Bar_1102": 1451,
        "Bar_1103": 1452,
        "Bar_1104": 1453,
        "Bar_1105": 1454,
        "Bar_1106": 1455,
        "Bar_1107": 1456,
        "Bar_1108": 1457,
        "Bar_1109": 1458,
        "Bar_1110": 1459,
        "Bar_1111": 1460,
        "Bar_1112": 1461,
        "Bar_1113": 1462,
        "Bar_1114": 1463,
        "Bar_1115": 1464,
        "Bar_1116": 1465,
        "Bar_1117": 1466,
        "Bar_1118": 1467,
        "Bar_1119": 1468,
        "Bar_1120": 1469,
        "Bar_1121": 1470,
        "Bar_1122": 1471,
        "Bar_1123": 1472,
        "Bar_1124": 1473,
        "Bar_1125": 1474,
        "Bar_1126": 1475,
        "Bar_1127": 1476,
        "Bar_1128": 1477,
        "Bar_1129": 1478,
        "Bar_1130": 1479,
        "Bar_1131": 1480,
        "Bar_1132": 1481,
        "Bar_1133": 1482,
        "Bar_1134": 1483,
        "Bar_1135": 1484,
        "Bar_1136": 1485,
        "Bar_1137": 1486,
        "Bar_1138": 1487,
        "Bar_1139": 1488,
        "Bar_1140": 1489,
        "Bar_1141": 1490,
        "Bar_1142": 1491,
        "Bar_1143": 1492,
        "Bar_1144": 1493,
        "Bar_1145": 1494,
        "Bar_1146": 1495,
        "Bar_1147": 1496,
        "Bar_1148": 1497,
        "Bar_1149": 1498,
        "Bar_1150": 1499,
        "Bar_1151": 1500,
        "Bar_1152": 1501,
        "Bar_1153": 1502,
        "Bar_1154": 1503,
        "Bar_1155": 1504,
        "Bar_1156": 1505,
        "Bar_1157": 1506,
        "Bar_1158": 1507,
        "Bar_1159": 1508,
        "Bar_1160": 1509,
        "Bar_1161": 1510,
        "Bar_1162": 1511,
        "Bar_1163": 1512,
        "Bar_1164": 1513,
        "Bar_1165": 1514,
        "Bar_1166": 1515,
        "Bar_1167": 1516,
        "Bar_1168": 1517,
        "Bar_1169": 1518,
        "Bar_1170": 1519,
        "Bar_1171": 1520,
        "Bar_1172": 1521,
        "Bar_1173": 1522,
        "Bar_1174": 1523,
        "Bar_1175": 1524,
        "Bar_1176": 1525,
        "Bar_1177": 1526,
        "Bar_1178": 1527,
        "Bar_1179": 1528,
        "Bar_1180": 1529,
        "Bar_1181": 1530,
        "Bar_1182": 1531,
        "Bar_1183": 1532,
        "Bar_1184": 1533,
        "Bar_1185": 1534,
        "Bar_1186": 1535,
        "Bar_1187": 1536,
        "Bar_1188": 1537,
        "Bar_1189": 1538,
        "Bar_1190": 1539,
        "Bar_1191": 1540,
        "Bar_1192": 1541,
        "Bar_1193": 1542,
        "Bar_1194": 1543,
        "Bar_1195": 1544,
        "Bar_1196": 1545,
        "Bar_1197": 1546,
        "Bar_1198": 1547,
        "Bar_1199": 1548,
        "Bar_1200": 1549,
        "Bar_1201": 1550,
        "Bar_1202": 1551,
        "Bar_1203": 1552,
        "Bar_1204": 1553,
        "Bar_1205": 1554,
        "Bar_1206": 1555,
        "Bar_1207": 1556,
        "Bar_1208": 1557,
        "Bar_1209": 1558,
        "Bar_1210": 1559,
        "Bar_1211": 1560,
        "Bar_1212": 1561,
        "Bar_1213": 1562,
        "Bar_1214": 1563,
        "Bar_1215": 1564,
        "Bar_1216": 1565,
        "Bar_1217": 1566,
        "Bar_1218": 1567,
        "Bar_1219": 1568,
        "Bar_1220": 1569,
        "Bar_1221": 1570,
        "Bar_1222": 1571,
        "Bar_1223": 1572,
        "Bar_1224": 1573,
        "Bar_1225": 1574,
        "Bar_1226": 1575,
        "Bar_1227": 1576,
        "Bar_1228": 1577,
        "Bar_1229": 1578,
        "Bar_1230": 1579,
        "Bar_1231": 1580,
        "Bar_1232": 1581,
        "Bar_1233": 1582,
        "Bar_1234": 1583,
        "Bar_1235": 1584,
        "Bar_1236": 1585,
        "Bar_1237": 1586,
        "Bar_1238": 1587,
        "Bar_1239": 1588,
        "Bar_1240": 1589,
        "Bar_1241": 1590,
        "Bar_1242": 1591,
        "Bar_1243": 1592,
        "Bar_1244": 1593,
        "Bar_1245": 1594,
        "Bar_1246": 1595,
        "Bar_1247": 1596,
        "Bar_1248": 1597,
        "Bar_1249": 1598,
        "Bar_1250": 1599,
        "Bar_1251": 1600,
        "Bar_1252": 1601,
        "Bar_1253": 1602,
        "Bar_1254": 1603,
        "Bar_1255": 1604,
        "Bar_1256": 1605,
        "Bar_1257": 1606,
        "Bar_1258": 1607,
        "Bar_1259": 1608,
        "Bar_1260": 1609,
        "Bar_1261": 1610,
        "Bar_1262": 1611,
        "Bar_1263": 1612,
        "Bar_1264": 1613,
        "Bar_1265": 1614,
        "Bar_1266": 1615,
        "Bar_1267": 1616,
        "Bar_1268": 1617,
        "Bar_1269": 1618,
        "Bar_1270": 1619,
        "Bar_1271": 1620,
        "Bar_1272": 1621,
        "Bar_1273": 1622,
        "Bar_1274": 1623,
        "Bar_1275": 1624,
        "Bar_1276": 1625,
        "Bar_1277": 1626,
        "Bar_1278": 1627,
        "Bar_1279": 1628,
        "Bar_1280": 1629,
        "Bar_1281": 1630,
        "Bar_1282": 1631,
        "Bar_1283": 1632,
        "Bar_1284": 1633,
        "Bar_1285": 1634,
        "Bar_1286": 1635,
        "Bar_1287": 1636,
        "Bar_1288": 1637,
        "Bar_1289": 1638,
        "Bar_1290": 1639,
        "Bar_1291": 1640,
        "Bar_1292": 1641,
        "Bar_1293": 1642,
        "Bar_1294": 1643,
        "Bar_1295": 1644,
        "Bar_1296": 1645,
        "Bar_1297": 1646,
        "Bar_1298": 1647,
        "Bar_1299": 1648,
        "Bar_1300": 1649,
        "Bar_1301": 1650,
        "Bar_1302": 1651,
        "Bar_1303": 1652,
        "Bar_1304": 1653,
        "Bar_1305": 1654,
        "Bar_1306": 1655,
        "Bar_1307": 1656,
        "Bar_1308": 1657,
        "Bar_1309": 1658,
        "Bar_1310": 1659,
        "Bar_1311": 1660,
        "Bar_1312": 1661
    },
    "_bpe_model": "{\"version\":\"1.0\",\"truncation\":null,\"padding\":null,\"added_tokens\":[{\"id\":0,\"content\":\"!\",\"single_word\":false,\"lstrip\":false,\"rstrip\":false,\"normalized\":false,\"special\":true},{\"id\":1,\"content\":\"\\\"\",\"single_word\":false,\"lstrip\":false,\"rstrip\":false,\"normalized\":false,\"special\":true},{\"id\":2,\"content\":\"#\",\"single_word\":false,\"lstrip\":false,\"rstrip\":false,\"normalized\":false,\"special\":true},{\"id\":3,\"content\":\"$\",\"single_word\":false,\"lstrip\":false,\"rstrip\":false,\"normalized\":false,\"special\":true}],\"normalizer\":null,\"pre_tokenizer\":null,\"post_processor\":null,\"decoder\":null,\"model\":{\"type\":\"BPE\",\"dropout\":null,\"unk_token\":null,\"continuing_subword_prefix\":null,\"end_of_word_suffix\":null,\"fuse_unk\":false,\"vocab\":{\"!\":0,\"\\\"\":1,\"#\":2,\"$\":3},\"merges\":[]}}",
    "_vocab_base_byte_to_token": {
        "!": "PAD_None",
        "\"": "BOS_None",
        "#": "EOS_None",
        "$": "MASK_None",
        "%": "Bar_0",
        "&": "Bar_1",
        "'": "Bar_2",
        "(": "Bar_3",
        ")": "Bar_4",
        "*": "Bar_5",
        "+": "Bar_6",
        ",": "Bar_7",
        "-": "Bar_8",
        ".": "Bar_9",
        "/": "Bar_10",
        "0": "Bar_11",
        "1": "Bar_12",
        "2": "Bar_13",
        "3": "Bar_14",
        "4": "Bar_15",
        "5": "Bar_16",
        "6": "Bar_17",
        "7": "Bar_18",
        "8": "Bar_19",
        "9": "Bar_20",
        ":": "Bar_21",
        ";": "Bar_22",
        "<": "Bar_23",
        "=": "Bar_24",
        ">": "Bar_25",
        "?": "Bar_26",
        "@": "Bar_27",
        "A": "Bar_28",
        "B": "Bar_29",
        "C": "Bar_30",
        "D": "Bar_31",
        "E": "Bar_32",
        "F": "Bar_33",
        "G": "Bar_34",
        "H": "Bar_35",
        "I": "Bar_36",
        "J": "Bar_37",
        "K": "Bar_38",
        "L": "Bar_39",
        "M": "Bar_40",
        "N": "Bar_41",
        "O": "Bar_42",
        "P": "Bar_43",
        "Q": "Bar_44",
        "R": "Bar_45",
        "S": "Bar_46",
        "T": "Bar_47",
        "U": "Bar_48",
        "V": "Bar_49",
        "W": "Bar_50",
        "X": "Bar_51",
        "Y": "Bar_52",
        "Z": "Bar_53",
        "[": "Bar_54",
        "\\": "Bar_55",
        "]": "Bar_56",
        "^": "Bar_57",
        "_": "Bar_58",
        "`": "Bar_59",
        "a": "Pitch_21",
        "b": "Pitch_22",
        "c": "Pitch_23",
        "d": "Pitch_24",
        "e": "Pitch_25",
        "f": "Pitch_26",
        "g": "Pitch_27",
        "h": "Pitch_28",
        "i": "Pitch_29",
        "j": "Pitch_30",
        "k": "Pitch_31",
        "l": "Pitch_32",
        "m": "Pitch_33",
        "n": "Pitch_34",
        "o": "Pitch_35",
        "p": "Pitch_36",
        "q": "Pitch_37",
        "r": "Pitch_38",
        "s": "Pitch_39",
        "t": "Pitch_40",
        "u": "Pitch_41",
        "v": "Pitch_42",
        "w": "Pitch_43",
        "x": "Pitch_44",
        "y": "Pitch_45",
        "z": "Pitch_46",
        "{": "Pitch_47",
        "|": "Pitch_48",
        "}": "Pitch_49",
        "~": "Pitch_50",
        "\u007f": "Pitch_51",
        "\u0080": "Pitch_52",
        "\u0081": "Pitch_53",
        "\u0082": "Pitch_54",
        "\u0083": "Pitch_55",
        "\u0084": "Pitch_56",
        "\u0085": "Pitch_57",
        "\u0086": "Pitch_58",
        "\u0087": "Pitch_59",
        "\u0088": "Pitch_60",
        "\u0089": "Pitch_61",
        "\u008a": "Pitch_62",
        "\u008b": "Pitch_63",
        "\u008c": "Pitch_64",
        "\u008d": "Pitch_65",
